app/src/main/res/raw/soap_upload_file

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <UploadFile xmlns="http://railway.gtwise.com">
            <fileBytes>$base64Binary</fileBytes>
            <fileName>$filename</fileName>
            <imageCategory>3</imageCategory>
            <sAuthInfo>$authInfo</sAuthInfo>
            <sSessionKey>$sessionKey</sSessionKey>
        </UploadFile>
    </soap:Body>
</soap:Envelope>